Revit 2027 API
FillGrid Properties
The FillGrid type exposes the following members.
Properties
Name | Description
Angle |  Gets and sets the angle of the fill grid.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Offset |  Gets and sets the offset of the fill grid.
Origin |  Gets and sets the origin of the fill grid.
Shift |  Gets and sets the shift of the fill grid.
Top
See Also
Reference
FillGrid Class
Autodesk.Revit.DB Namespace